Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginCreationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginCreationFeatureBase class provides the base class for creation features for plugins.
Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase

Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginCreationFeatureBase.#ctor(System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginCreationFeatureBase class.
name: The name of the plugin.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.